In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/021.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                   3
0      NaN  NaN  NaN  Lewis (D)  122,380
1      NaN  NaN  NaN              100.0%
2   County   PR   TP                 NaN
3  CLAYTON    8    8                1544
4   DEKALB   42   42               28136

In [5]:
df = df[3:]

In [6]:
df.head(5)

         0    1    2      3
3  CLAYTON    8    8   1544
4   DEKALB   42   42  28136
5   FULTON  221  221  92700

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

         0      3
3  CLAYTON   1544
4   DEKALB  28136
5   FULTON  92700

In [9]:
df.columns = ['county', 'John Lewis']

In [10]:
df.tail(5)

    county John Lewis
3  CLAYTON       1544
4   DEKALB      28136
5   FULTON      92700

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

    county   candidate  votes
0  CLAYTON  John Lewis   1544
1   DEKALB  John Lewis  28136
2   FULTON  John Lewis  92700

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
county       3 non-null object
candidate    3 non-null object
votes        3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '5'

In [18]:
df['party'] = 'Democrat'

In [19]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate   party
John Lewis  Democrat    122380
Name: votes, dtype: int64

In [20]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district     party   candidate  votes
0  CLAYTON  U.S. Representative        5  Democrat  John Lewis   1544
1   DEKALB  U.S. Representative        5  Democrat  John Lewis  28136
2   FULTON  U.S. Representative        5  Democrat  John Lewis  92700

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')